USE express;

-- 初始化系统用户
INSERT INTO User_ (user_id, user_name, user_type, telephone_number, payment)
VALUES (10086, 'system', 'S', NULL, NULL);

-- 初始化快递站点
INSERT INTO TransferStation (station_id, nickname, location, type, creator, manager)
VALUES (1, '武汉转运中心', '中国|湖北|武汉|市级仓库', '一级仓库', 10086, 10086),
       (2, '武东城区总站', '中国|湖北|武汉|东区仓库', '二级仓库', 10086, 10086),
       (3, '武东1街分站', '中国|湖北|武汉|东1街仓库', '三级仓库', 10086, 10086),
       (4, '武东2街分站', '中国|湖北|武汉|东2街仓库', '三级仓库', 10086, 10086),

       (5, '深圳转运中心', '中国|广东|深圳|市级仓库', '一级仓库', 10086, 10086),
       (6, '深东城区总站', '中国|广东|深圳|东区仓库', '二级仓库', 10086, 10086),
       (7, '深西城区总站', '中国|广东|深圳|西区仓库', '二级仓库', 10086, 10086),
       (8, '深东1街分站', '中国|广东|深圳|东1街仓库', '三级仓库', 10086, 10086),
       (9, '深西1街分站', '中国|广东|深圳|西1街仓库', '三级仓库', 10086, 10086),

       (10, '东京转运中心', '日本|东京|市级仓库', '一级仓库', 10086, 10086),
       (11, '东京新宿站', '日本|东京|新宿|区级仓库', '二级仓库', 10086, 10086);